def a_plus_abs_b(a, b):
	if b > 0:
		return a + b
	else:
		return a - b  
# a_plus_abs_b ֆունկցիանին տալիս ենք a և b արժեքներ։ 
#Եթե b դրական է ֆունկցիան վերադարձնում է a+b, 
#հակառակ դեպքում ՝ a-b, արդյունքոըմ ունենում ենք a-ի և 
# b-ի մոդուլի գումարը։



def a_plus_abs_b(a, b):
	if b > 0:
		return a + b
	return a - b
#a_plus_abs_b ֆունկցիանին տալիս ենք a և b արժեքներ։
#Եթե b դրական է ֆունկցիան վերադարձնում է a+b, հակառակ դեպքում 
#ֆ-ն շարունակում է աշխատանքը ու պայմանից դուրս վերադարձնում 
#a-b ՝ անկախ b-ի արժեքից